src/Documents/АктПриемкиТоваров/АктПриемкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемкиТоваров</name>
  <comment>Аналог документа с ЭДиН.</comment>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыЕзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаказанногоТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставленногоТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринятогоТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНепринятогоТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/МаркировкаИПрослеживаемость/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Функция определяет содержит ли акт приемки товаров данный код маркировки, был ли
// он уже обработан, и увеличивает счетчик с количеством принятого товара.
// 
// Параметры:
//  АктПриемкиТоваров - ДокументСсылка.АктПриемкиТоваров
//  КодМаркировки - Строка
// 
// Возвращаемое значение:
//  См. НовоеОписаниеОбработкиШтрихкода
Функция ОбработатьКодМаркировки(Знач АктПриемкиТоваров, Знач КодМаркировки) Экспорт

    НачатьТранзакцию();

    Попытка

        ОписаниеОбработкиШтрихкода = НовоеОписаниеОбработкиШтрихкода();
        
        // 1. Поиск строки табличной части "Номенклатура", подходящей коду маркировки
        Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                              |    ВсяНоменклатура.НомерСтроки КАК НомерСтроки,
                              |    ВсяНоменклатура.Номенклатура КАК Номенклатура,
                              |    ВсяНоменклатура.КоличествоПоставленногоТовара КАК КоличествоПоставленногоТовара,
                              |    ВсяНоменклатура.КоличествоПринятогоТовара КАК КоличествоПринятогоТовара
                              |ИЗ
                              |    Документ.АктПриемкиТоваров.Номенклатура КАК ВсяНоменклатура
                              |ГДЕ
                              |    ВсяНоменклатура.Ссылка = &Документ
                              |    И ВсяНоменклатура.КлючСвязи В
                              |        (ВЫБРАТЬ ПЕРВЫЕ 1
                              |            ВсеКодыМаркировки.КлючСвязи
                              |        ИЗ
                              |            Документ.АктПриемкиТоваров.КодыМаркировки КАК ВсеКодыМаркировки
                              |        ГДЕ
                              |            ВсеКодыМаркировки.Ссылка = &Документ
                              |            И ВсеКодыМаркировки.КодМаркировки = &КодМаркировки)");

        Запрос.УстановитьПараметр("КодМаркировки", КодМаркировки);
        Запрос.УстановитьПараметр("Документ", АктПриемкиТоваров);
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();

        Если Не Выборка.Следующий() Тогда

            ОтменитьТранзакцию();

            ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаНеНайденКодМаркировки();

            Возврат ОписаниеОбработкиШтрихкода;

        КонецЕсли;

        ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаУспех();
        ОписаниеОбработкиШтрихкода.НомерНоменклатуры = 1;
        ОписаниеОбработкиШтрихкода.ПредыдущееКоличество = 3;
        ОписаниеОбработкиШтрихкода.НовоеКоличество = 2;

        Возврат ОписаниеОбработкиШтрихкода;

    Исключение

        ОтменитьТранзакцию();
        ВызватьИсключение;

    КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция создает описание обработки штрихкода.
// 
// Возвращаемое значение:
//  Структура - Описание обработки штрихкода:
// * КодВозврата - Число - Код, указывающий на результат обработки штрихкода
// * НомерНоменклатуры - Неопределено, Число - Номер строки табличной части "Номенклатура" документа "АктПриемкиТоваров",
//                                             которой соответствовал обрабатываемый штрихкод
// * ПредыдущееКоличество - Неопределено, Число - Значение реквизита "КоличествоПринятогоТовара" до обработки штрихкода
// * НовоеКоличество - Неопределено, Число - Значение реквизита "КоличествоПринятогоТовара" после обработки штрихкода
Функция НовоеОписаниеОбработкиШтрихкода() Экспорт

    ОписаниеОбработкиШтрихкода = Новый Структура;

    ОписаниеОбработкиШтрихкода.Вставить("КодВозврата", КодВозвратаУспех());
    ОписаниеОбработкиШтрихкода.Вставить("НомерНоменклатуры", Неопределено);
    ОписаниеОбработкиШтрихкода.Вставить("ПредыдущееКоличество", Неопределено);
    ОписаниеОбработкиШтрихкода.Вставить("НовоеКоличество", Неопределено);

    Возврат ОписаниеОбработкиШтрихкода;

КонецФункции

#КонецОбласти
